# Ejemplo Practico para Pandas con Data Frames

## 1. Inspeccion inicial  del dataframe

In [1]:
# Importacion de librerias
import pandas as pd

In [2]:
#crear un dataframe a partir de un diccionario

data = {
    'Nombre' : ['Ana','Luis','Carlos', 'Lucia', 'Martha','Jorge', 'Sofia'],
    'Edad' : [23,35,45,25,30,28,32],
    'Ciudad' : ['CDMX', 'Guadalajara', 'Monterrey', 'CDMX','Puebla', 'CDMX', 'Guadalajara'],
    'Salario' : [12000,15000,18000,12500,14000,13000,15500],
    'Departamento' : ['Ventas','Marketing','Ventas','TI','TI','Markting','Ventas']
    }

In [3]:
df = pd.DataFrame(data)
df

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
1    Luis    35  Guadalajara    15000    Marketing
2  Carlos    45    Monterrey    18000       Ventas
3   Lucia    25         CDMX    12500           TI
4  Martha    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000     Markting
6   Sofia    32  Guadalajara    15500       Ventas

### 2. Estructura

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        7 non-null      object
 1   Edad          7 non-null      int64
 2   Ciudad        7 non-null      object
 3   Salario       7 non-null      int64
 4   Departamento  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [5]:
df.shape

(7, 5)

In [10]:
df.shape[0]

7

In [11]:
df.shape[1]

5

In [6]:
df.describe

<bound method NDFrame.describe of    Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
1    Luis    35  Guadalajara    15000    Marketing
2  Carlos    45    Monterrey    18000       Ventas
3   Lucia    25         CDMX    12500           TI
4  Martha    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000     Markting
6   Sofia    32  Guadalajara    15500       Ventas>

In [7]:
df.dtypes

Nombre          object
Edad             int64
Ciudad          object
Salario          int64
Departamento    object
dtype: object

In [8]:
df.columns

Index(['Nombre', 'Edad', 'Ciudad', 'Salario', 'Departamento'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=7, step=1)

## 3. Seleccion de columnas y Filas

In [13]:
# selecciona una sola columna del dataframe como una serie
df['Edad']

   Edad
0    23
1    35
2    45
3    25
4    30
5    28
6    32

In [14]:
type(df['Edad'])

pandas.core.series.Series

In [15]:
df[['Edad']]

   Edad
0    23
1    35
2    45
3    25
4    30
5    28
6    32

In [17]:
#una lista dentro de otra
df[['Salario', 'Nombre', 'Departamento']]

   Salario  Nombre Departamento
0    12000     Ana       Ventas
1    15000    Luis    Marketing
2    18000  Carlos       Ventas
3    12500   Lucia           TI
4    14000  Martha           TI
5    13000   Jorge     Markting
6    15500   Sofia       Ventas

# 4.Filtrado

In [23]:
df[df['Ciudad'] == 'CDMX']

  Nombre  Edad Ciudad  Salario Departamento
0    Ana    23   CDMX    12000       Ventas
3  Lucia    25   CDMX    12500           TI
5  Jorge    28   CDMX    13000     Markting

In [24]:
df[df['Ciudad'] == 'CDMX'][['Nombre', 'Ciudad','Salario']]

  Nombre Ciudad  Salario
0    Ana   CDMX    12000
3  Lucia   CDMX    12500
5  Jorge   CDMX    13000

define una variable en donde guardes los de la ciudad

In [25]:
df_cdmx = df[df['Ciudad'] == 'CDMX']

In [26]:
df_cdmx[['Nombre','Ciudad','Salario']]

  Nombre Ciudad  Salario
0    Ana   CDMX    12000
3  Lucia   CDMX    12500
5  Jorge   CDMX    13000

In [30]:
# Mostrar todas las filas de la ciudad de mexico y del departamento de ti

df[(df['Ciudad'] == 'CDMX') & (df['Departamento'] == 'TI')]

  Nombre  Edad Ciudad  Salario Departamento
3  Lucia    25   CDMX    12500           TI

In [31]:
# MOSTRAR TODAS LAS FILAS DE LA CIUDAD DE MEXICO O DEL DEPARTAMENTO DE TI
df[(df['Ciudad'] == 'CDMX') | (df['Departamento'] == 'TI')]

   Nombre  Edad  Ciudad  Salario Departamento
0     Ana    23    CDMX    12000       Ventas
3   Lucia    25    CDMX    12500           TI
4  Martha    30  Puebla    14000           TI
5   Jorge    28    CDMX    13000     Markting

# 5. ORDENAR FILAS

In [33]:
# ordena por salario de forma asendente (A-Z, 0-9)
df.sort_values(by= 'Salario')

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000     Markting
4  Martha    30       Puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas

In [ ]:
# ordena por salario de forma desendente (Z-A, 9-0)
df.sort_values(by= 'Salario', ascending= False)

In [34]:
#ORDENAR POR EL SALARIO Y LA CIUDAD
df.sort_values(by=['Ciudad', 'Salario'])

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000     Markting
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
2  Carlos    45    Monterrey    18000       Ventas
4  Martha    30       Puebla    14000           TI

In [37]:
df.sort_values(by=['Ciudad', 'Salario'] ,ascending= False)

   Nombre  Edad       Ciudad  Salario Departamento
4  Martha    30       Puebla    14000           TI
2  Carlos    45    Monterrey    18000       Ventas
6   Sofia    32  Guadalajara    15500       Ventas
1    Luis    35  Guadalajara    15000    Marketing
5   Jorge    28         CDMX    13000     Markting
3   Lucia    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas

In [38]:
# ORDENA DEPENDIENDO LOS PARAMETROS QUE LE DIGAS
df.sort_values(by=['Ciudad', 'Salario'] ,ascending= [False, True])

   Nombre  Edad       Ciudad  Salario Departamento
4  Martha    30       Puebla    14000           TI
2  Carlos    45    Monterrey    18000       Ventas
1    Luis    35  Guadalajara    15000    Marketing
6   Sofia    32  Guadalajara    15500       Ventas
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000     Markting

In [41]:
df[(df['Ciudad'] == 'CDMX') | (df['Departamento'] == 'TI')].sort_values(by=['Edad','Departamento'],ascending=[True, False])

   Nombre  Edad  Ciudad  Salario Departamento
0     Ana    23    CDMX    12000       Ventas
3   Lucia    25    CDMX    12500           TI
5   Jorge    28    CDMX    13000     Markting
4  Martha    30  Puebla    14000           TI

## 6 CREAR NUEVAS COLUMNA

In [42]:
df['Salario_Anual'] = df['Salario'] * 12

In [43]:
df

   Nombre  Edad       Ciudad  Salario Departamento  Salario_Anual
0     Ana    23         CDMX    12000       Ventas         144000
1    Luis    35  Guadalajara    15000    Marketing         180000
2  Carlos    45    Monterrey    18000       Ventas         216000
3   Lucia    25         CDMX    12500           TI         150000
4  Martha    30       Puebla    14000           TI         168000
5   Jorge    28         CDMX    13000     Markting         156000
6   Sofia    32  Guadalajara    15500       Ventas         186000